{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "openlm-research/open_llama_3b_v2",
  "bias": "none",
  "fan_in_fan_out": null,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.0,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "up_proj",
    "gate_proj",
    "k_proj",
    "o_proj",
    "q_proj",
    "down_proj",
    "v_proj"
  ],
  "task_type": "CAUSAL_LM"
}